[
  {
    "id": 1,
    "title": "WorkPulse",
    "category":"Fullstack",
    "description": "A full-stack platform for tracking employee workflows, managing payroll, and streamlining HR operations. WorkPulse IT allows employees to log daily work updates, while HR and admin users can handle payrolls, process Stripe payments, and manage internal operations with protected access.",
    "image": "https://i.ibb.co/WW100PWV/workpulse.png",
    "stack": [
      "React",
      "TailwindCss",
      "ShadCN/UI",
      "Node.js",
      "MongoDB",
      "Firebase",
      "Stripe"
    ],
    "codeUrl": "https://github.com/srpinki/workpulse-client",
    "liveUrl": "https://workpulseit.netlify.app/",
    "challenges": [
      "Building a secure role-based access system using Firebase authentication.",
      "Integrating Stripe for smooth and secure payroll transactions.",
      "Managing admin-only routes and real-time dashboard updates efficiently.",
      "Designing a responsive dashboard interface with modular, reusable components.",
      "Implementing smart filtering for payroll history by date, with dynamic querying."
    ],
    "plans": [
      "Add email notifications for payroll status updates.",
      "Implement export to PDF for salary history and task logs.",
      "Create employee performance analytics with chart visualizations.",
      "Introduce multi-language support for international teams."
    ]
  },
  {
    "id": 2,
    "title": "Plant Manager",
    "category":"Frontend",
    "description": "A platform to manage plant care tasks with reminders and health tracking.This platform allows users to log, track, and manage care tasks for their houseplants. Users can add their plants, log watering/fertilizing dates, set reminders, and track plant health. The platform will support user authentication and personal plant data management.",
    "image": "https://i.ibb.co/MD0phjSd/Plantera-Your-Ultimate-Plant-Care-Companion-06-29-2025-10-44-PM.png",
    "stack": [
      "React",
      "TailwindCss",
      "DaisyUi",
      "Node.js",
      "MongoDB",
      "Firebase"
    ],
    "codeUrl": "https://github.com/srpinki/plantera-client",
    "liveUrl": "https://planterait.netlify.app/",
    "challenges": [
      "Ensuring secure user authentication and protected route access with JWT and Firebase.",
      "Managing complex state across multiple components for plant data, reminders, and user roles.",
      "Implementing responsive UI design that works seamlessly across mobile and desktop.",
      "Handling role-based access for users and admins with dynamic dashboard rendering.",
      "Optimizing MongoDB queries for fast retrieval of personalized plant data."
    ],
    "plans": [
      "Add push notifications for watering/fertilizing reminders.",
      "Create a calendar view for task tracking.",
      "Introduce plant care tips based on plant type and season.",
      "Enable community forum or user-shared plant care experiences."
    ]
  },
  {
    "id": 3,
    "title": "Service Sharing Platform",
    "category":"Fullstack",
    "description": "An advanced job search and career platform with multiple search job matching.",
    "image": "https://i.ibb.co/TDGBycFw/fixitron.png",
    "stack": ["React.js", "TailwindCss", "Express.js", "MongoDB", "Firebase"],
    "codeUrl": "https://github.com/srpinki/fixitron-client",
    "liveUrl": "https://fixitron.netlify.app/",
    "challenges": [
      "Secure authentication and authorization flow using JWT and Firebase.",
      "Scalable job listing with filtering and search optimization.",
      "Responsive UI for job seekers and recruiters.",
      "Role-based access and dynamic dashboards.",
      "Real-time messaging between users."
    ],
    "plans": [
      "Add AI-based resume scoring system.",
      "Integrate calendar scheduling for interviews."
    ]
  }
]
